---
kind: type
id: T:Autodesk.Revit.DB.RenderingQualitySettings
source: html/400738fc-3791-666c-10f3-ec46c771d6d5.htm
---
# Autodesk.Revit.DB.RenderingQualitySettings

Represents the quality settings of rendering.

## Syntax (C#)
```csharp
public class RenderingQualitySettings : IDisposable
```

## Remarks
The other properties in this class can only be modified if the RenderingQuality property is currently set to Custom.